---
kind: property
id: P:Autodesk.Revit.DB.TextElement.BaseDirection
source: html/19eff725-f901-442d-4945-5b16002c9e07.htm
---
# Autodesk.Revit.DB.TextElement.BaseDirection Property

Direction of the base line of the text element.

## Syntax (C#)
```csharp
public XYZ BaseDirection { get; }
```

## Remarks
Base direction is always perpendicular to Up direction.
 Those two vectors together define the plane of the text.